# Hiragana
hiragana_basic = {
    "あ": "а", "い": "і", "う": "у", "え": "е", "お": "о",
    "か": "ка", "き": "кі", "く": "ку", "け": "ке", "こ": "ко",
    "さ": "са", "し": "ші", "す": "су", "せ": "се", "そ": "со",
    "た": "та", "ち": "чі", "つ": "цу", "て": "те", "と": "то",
    "な": "на", "に": "ні", "ぬ": "ну", "ね": "не", "の": "но",
    "は": "ха", "ひ": "хі", "ふ": "фу", "へ": "хе", "ほ": "хо",
    "ま": "ма", "み": "мі", "む": "му", "め": "ме", "も": "мо",
    "や": "я", "ゆ": "ю", "よ": "йо",
    "ら": "ра", "り": "рі", "る": "ру", "れ": "ре", "ろ": "ро",
    "わ": "ва", "を": "о", "ん": "н",
}

hiragana_combinations = {
    "きゃ": "кя", "きゅ": "кю", "きょ": "кьо",
    "しゃ": "шя", "しゅ": "шю", "しょ": "шьо",
    "ちゃ": "чя", "ちゅ": "чю", "ちょ": "чьо",
    "にゃ": "ня", "にゅ": "ню", "にょ": "ньо",
    "ひゃ": "хя", "ひゅ": "хю", "ひょ": "хьо",
    "みゃ": "мя", "みゅ": "мю", "みょ": "мьо",
    "りゃ": "ря", "りゅ": "рю", "りょ": "рьо",
}

hiragana_kuten = {
    "が": "ґа", "ぎ": "ґі", "ぐ": "ґу", "げ": "ґе", "ご": "ґо",
    "ざ": "дза", "じ": "джі", "ず": "дзу", "ぜ": "дзе", "ぞ": "дзо",
    "だ": "да", "ぢ": "джі", "づ": "дзу", "で": "де", "ど": "до",
    "ば": "ба", "び": "бі", "ぶ": "бу", "べ": "бе", "ぼ": "бо",
    "ぱ": "па", "ぴ": "пі", "ぷ": "пу", "ぺ": "пе", "ぽ": "по",
}


hiragana_kuten_combinations = {
    "ぎゃ": "ґя", "ぎゅ": "ґю", "ぎょ": "ґьо",
    "じゃ": "джя", "じゅ": "джю", "じょ": "джьо",
    "ぢゃ": "джя", "ぢゅ": "джю", "ぢょ": "джьо",
    "びゃ": "бя", "びゅ": "бю", "びょ": "бьо",
    "ぴゃ": "пя", "ぴゅ": "пю", "ぴょ": "пьо",
}

hiragana_full = {**hiragana_basic, **hiragana_combinations,
                 **hiragana_kuten, **hiragana_kuten_combinations}

hiragana_stats = {k[0]: {"right": 0, "wrong": 0}
                  for k in hiragana_full.items()}

# Katakana
katakana_basic = {
    "ア": "а", "イ": "і", "ウ": "у", "エ": "е", "オ": "о",
    "カ": "ка", "キ": "кі", "ク": "ку", "ケ": "ке", "コ": "ко",
    "サ": "са", "シ": "ші", "ス": "су", "セ": "се", "ソ": "со",
    "タ": "та", "チ": "чі", "ツ": "цу", "テ": "те", "ト": "то",
    "ナ": "на", "ニ": "ні", "ヌ": "ну", "ネ": "не", "ノ": "но",
    "ハ": "ха", "ヒ": "хі", "フ": "фу", "ヘ": "хе", "ホ": "хо",
    "マ": "ма", "ミ": "мі", "ム": "му", "メ": "ме", "モ": "мо",
    "ヤ": "я", "ユ": "ю", "ヨ": "йо",
    "ラ": "ра", "リ": "рі", "ル": "ру", "レ": "ре", "ロ": "ро",
    "ワ": "ва", "ヲ": "о", "ン": "н",
}

katakana_combinations = {
    "キャ": "кя", "キュ": "кю", "キョ": "кьо",
    "シャ": "шя", "シュ": "шю", "ショ": "шьо",
    "チャ": "чя", "チュ": "чю", "チョ": "чьо",
    "ニャ": "ня", "ニュ": "ню", "ニョ": "ньо",
    "ヒャ": "хя", "ヒュ": "хю", "ヒョ": "хьо",
    "ミャ": "мя", "ミュ": "мю", "ミョ": "мьо",
    "リャ": "ря", "リュ": "рю", "リョ": "рьо",
}

katakana_kuten = {
    "ガ": "ґа", "ギ": "ґі", "グ": "ґу", "ゲ": "ґе", "ゴ": "ґо",
    "ザ": "дза", "ジ": "джі", "ズ": "дзу", "ゼ": "дзе", "ゾ": "дзо",
    "ダ": "да", "ヂ": "джі", "ヅ": "дзу", "デ": "де", "ド": "до",
    "バ": "ба", "ビ": "бі", "ブ": "бу", "ベ": "бе", "ボ": "бо",
    "パ": "па", "ピ": "пі", "プ": "пу", "ペ": "пе", "ポ": "по",
}

katakana_kuten_combinations = {
    "ギャ": "ґя", "ギュ": "ґю", "ギョ": "ґьо",
    "ジャ": "джя", "ジュ": "джю", "ジョ": "джьо",
    "ヂャ": "джя", "ヂュ": "джю", "ヂョ": "джьо",
    "ビャ": "бя", "ビュ": "бю", "ビョ": "бьо",
    "ピャ": "пя", "ピュ": "пю", "ピョ": "пьо",
}

katakana_full = {**katakana_basic, **katakana_combinations,
                 **katakana_kuten, **katakana_kuten_combinations}

katakana_stats = {k[0]: {"right": 0, "wrong": 0}
                  for k in katakana_full.items()}
